examples/dfLowMachFoam/LOX-pintle-diagnosis/gasHTFeedback_auto_T100_T150/system/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version: 7                                      |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 0.001;


vertices
(
    (0      0   39)     // 0
    (0   	0   360)    // 1
    (15	    0   -10)    // 2
    (15     0   0)    	// 3
    (15     0   39)     // 4
    (15     0   360)    // 5
    (17     0   -10)    // 6
    (17     0   0)		// 7
	(17		0	39)		// 8
	(17		0	360)	// 9
	(49.5	0	0)		// 10
	(49.5	0	39)		// 11
	(49.5	0	360)	// 12
	(0      0.05   39)      // 13
    (0   	0.05   360)     // 14
    (15	    0.05   -10)     // 15
    (15     0.05   0)    	// 16
    (15     0.05   39)      // 17
    (15     0.05   360)     // 18
    (17     0.05   -10)     // 19
    (17     0.05   0)		// 20
	(17		0.05	39)		// 21
	(17		0.05	360)	// 22
	(49.5	0.05	0)		// 23
	(49.5	0.05	39)		// 24
	(49.5	0.05	360)	// 25
);

blocks
(
    hex ( 2 6 19 15 3 7 20 16 )  ( 8 1 10 ) simpleGrading ( 1 1 1 )
	hex ( 3 7 20 16 4 8 21 17 )  ( 8 1 78 ) simpleGrading ( 1 1 1 )
	hex ( 7 10 23 20 8 11 24 21 )  ( 33 1 78 ) simpleGrading ( ((0.2 0.3 4) (0.6 0.4 1) (0.2 0.3 0.25)) 1 1 )
	hex ( 0 4 17 13 1 5 18 14 )  ( 15 1 321 ) simpleGrading ( ((0.6 0.4 1) (0.4 0.6 0.5)) 1 4 )
	hex ( 4 8 21 17 5 9 22 18 )  ( 8 1 321 ) simpleGrading ( 1 1 4 )
	hex ( 8 11 24 21 9 12 25 22 )  ( 33 1 321 ) simpleGrading ( ((0.2 0.3 4) (0.6 0.4 1) (0.2 0.3 0.25)) 1 4 )
);

edges
(
);

boundary
(
    front
    {
        type empty;
        faces
        (
            (2 3 7 6)
            (3 4 8 7)
            (7 8 11 10)
            (0 1 5 4)
            (4 5 9 8)
            (8 9 12 11)
        );
    }

    back
    {
        type empty;
        faces
        (
            (15 16 20 19)
            (16 17 21 20)
            (20 21 24 23)
            (13 14 18 17)
            (17 18 22 21)
            (21 22 25 24)
        );
    }

	wall
	{
		type wall;
		faces
		(
			(6 7 20 19)
			(2 3 16 15)
			(3 4 17 16)
			(10 7 20 23)
			(10 11 24 23)
			(4 0 13 17)
			(11 12 25 24)
		);
	}

	fuel
	{
		type patch;
		faces
		(
			(6 2 15 19)
		);
	}

	axis
	{
		type patch;
		faces
		(
			(0 1 14 13)
		);
	}

	outlet
	{
		type outlet;
		faces
		(
			(5 1 14 18)
			(9 5 18 22)
			(12 9 22 25)
		);
	}
);

mergePatchPairs
(
);