examples/dfLowMachFoam/LOX-pintle-diagnosis/gasHTFeedback_auto_T100_T150/constant/CanteraTorchProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version          2.0;
    format           ascii;
    class            dictionary;
    location         "constant";
    object           CanteraTorchProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistry            on;

CanteraMechanismFile "ramec44.yaml";

GPSODECoeffs
{
    blockNumber      4;
}

transportModel       "Mix";

odeCoeffs
{
    "relTol"         1e-6;
    "absTol"         1e-10;
}

AmgxSettings
{}

inertSpecie          "N2";
fuel                 "CH4";

splittingStrategy    off;

TorchSettings
{
    torch            off;
}

loadbalancing
{
    active           true;
    log              false;
    algorithm        allAverage;//headTail;
}


// ************************************************************************* //
