examples/dfLowMachFoam/LOX-pintle-diagnosis/gasHTFeedback_auto_T100_T150/constant/sprayCloudProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "constant";
    object      SprayCloudProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solution
{
    active          true;
    coupled         true;
    transient       yes;
    cellValueSourceCorrection on;
    maxCo           0.2;

    sourceTerms
    {
        schemes
        {
            rho             explicit 1;
            U               explicit 1;
            Yi              explicit 1;
            h               explicit 1;
            radiation       explicit 1;
        }
    }

    interpolationSchemes
    {
        rho             cell;
        U               cellPoint;
        thermo:mu       cell;
        T               cell;
        Cp              cell;
        kappa           cell;
        p               cell;
        DUcDt           cellPoint;
    }

    integrationSchemes
    {
        U               Euler;
        T               analytical;
    }
}


gasHeatTransferFeedbackControl
{
    active          true;

    mode            autoByMinT;

    TminOn          100;
    TminOff         150;

    suppressOnlyNegativeConvectiveHeatTransfer true;

    keepParcelHeating true;
    keepPhaseChange true;

    diagnostic      true;
}


constantProperties
{
    T0              110;

    // place holders for rho0 and Cp0
    // - reset from liquid properties using T0
    rho0            1140;
    Cp0             1700;

    constantVolume  false;
}


subModels
{
    particleForces
    {
        sphereDrag;
        gravity;
    }

    injectionModels
    {
	    model1
        {
            type            patchInjection;
            patchName       LOX;
            SOI             0;
            massTotal       0.133125;
            parcelBasisType mass;
            injectionMethod disc;
            flowType        fixedVelocity;
            U0	            (21.4792 4.2725 0);
            duration        1;
            parcelsPerSecond 1e+07;
            flowRateProfile table
	        (
		        (0	0.1)
		        (1e-05	0.3)
		        (6e-05	0.8)
		        (1e-04	1)
		        (1	0)
	        );
		sizeDistribution
            {
		        type uniform;

                uniformDistribution
                {
                    minValue        50e-06;
                    maxValue        50e-06;
                }
            }
        }
    }

    dispersionModel stochasticDispersionRAS;

    patchInteractionModel standardWallInteraction;

    heatTransferModel RanzMarshall;

    compositionModel singlePhaseMixture;

    phaseChangeModel liquidEvaporation;

    surfaceFilmModel none;

    atomizationModel none;

    breakupModel    ReitzDiwakar;

    stochasticCollisionModel none;

    radiation       off;

    standardWallInteractionCoeffs
    {
        type            rebound;
    }

    RanzMarshallCoeffs
    {
        BirdCorrection  true;
    }

    singlePhaseMixtureCoeffs
    {
        phases
        (
            liquid
            {
                O2               1;
            }
        );
    }

    liquidEvaporationBoilCoeffs
    {
        enthalpyTransfer enthalpyDifference;

        activeLiquids    ( O2 );
    }

    ReitzDiwakarCoeffs
    {
        solveOscillationEq yes;
        Cbag            6;
        Cb              0.785;
        Cstrip          0.5;
        Cs              10;
    }

    TABCoeffs
    {
        y0              0;
        yDot0           0;
        Cmu             10;
        Comega          8;
        WeCrit          12;
    }
/*
    LISACoeffs
    {
        Cl                0.5;
        cTau              12.0;
        Q                 1.0e-3;
        J                 0;       // not used
        lisaExp           0.27;
        injectorDirection (0 1 0);
        SMDCalculationMethod method2;
    }
*/

}


cloudFunctions
{}


// ************************************************************************* //
