examples/dfLowMachFoam/LOX-pintle-diagnosis/gasHTFeedback_auto_T100_T150/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 37.5e5;

boundaryField
{
    fuel
    {
        type            zeroGradient;
    }

    LOX
    {
        type            zeroGradient;
    }

    outlet
    {
	    type 		    waveTransmissive;
	    gamma 		    1.4;
    }

    wall
    {
        type            zeroGradient;
    }

    front
    {
        type            cyclic;
    }

    back
    {
        type            cyclic;
    }
}

// ************************************************************************* //
