examples/dfLowMachFoam/LOX-pintle-diagnosis/gasHTFeedback_auto_T100_T150/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 100;

boundaryField
{
	fuel
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.00028;
        value           uniform 340000;
    }

    LOX
    {
        type            fixedValue;
        value           uniform 1e-4;
    }

    wall
    {
        type            epsilonWallFunction;
        value           uniform 100;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1e-4;
        value           uniform 100;
    }

	front
    {
        type            cyclic;
    }

    back
    {
        type            cyclic;
    }
}

// ************************************************************************* //