examples/dfLowMachFoam/LOX-pintle-diagnosis/gasHTFeedback_auto_T100_T150/0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.0;

boundaryField
{
    fuel
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 70;
    }

    LOX
    {
        type            fixedValue;
        value           uniform 1e-4;
    }

    wall
    {
        type            kqRWallFunction;
        value           uniform 1.0;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1e-4;
        value           uniform 1.0;
    }

    front
    {
        type            cyclic;
    }

    back
    {
        type            cyclic;
    }
}
